s='''陈某某    三级主任医师'''

d={}

sort_gw=['特级主任医师岗位', '特级主任药师岗位', '特级主任护师岗位', '特级主任技师岗位', 
'一级主任医师岗位', '一级主任药师岗位', '一级主任护师岗位', '一级主任技师岗位',
 '二级主任医师岗位', '二级主任药师岗位', '二级主任护师岗位', '二级主任技师岗位', 
 '三级主任医师岗位', '三级主任药师岗位', '三级主任护师岗位', '三级主任技师岗位', 
 '一级副主任医师岗位', '一级副主任药师岗位', '一级副主任护师岗位', '一级副主任技师岗位', 
 '二级副主任医师岗位', '二级副主任药师岗位', '二级副主任护师岗位', '二级副主任技师岗位', 
 '三级副主任医师岗位', '三级副主任药师岗位', '三级副主任护师岗位', '三级副主任技师岗位', 
 '一级主治医师岗位', '一级主管药师岗位', '一级主管护师岗位', '一级主管技师岗位', '二级主治医师岗位', '二级主管药师岗位', '二级主管护师岗位', '二级主管技师岗位', '三级主治医师岗位', '三级主管药师岗位', '三级主管护师岗位', '三级主管技师岗位', '一级医师岗位', '一级药师岗位', '一级护师岗位', '一级技师岗位', '二级医师岗位', '二级药师岗位', '二级护师岗位', '二级技师岗位', '医士岗位', '药士岗位', '护士岗位', '技士岗位']


for e in s.split('\n'):
    name, gw = e.split()
    if gw not in d:
        d[gw]=[]
    d[gw].append(name)

for gw in sorted(d.keys()):
    names=d[gw]
    # print('%s：%s；'%(gw,'，'.join(names)))

s='''特级主任医师岗位   一级主任医师岗位    二级主任医师岗位    三级主任医师岗位    一级副主任医师岗位   二级副主任医师岗位   三级副主任医师岗位   一级主治医师岗位    二级主治医师岗位    三级主治医师岗位    一级医师岗位  二级医师岗位   医士岗位
特级主任中医师岗位   一级主任中医师岗位    二级主任中医师岗位    三级主任中医师岗位    一级副主任中医师岗位   二级副主任中医师岗位   三级副主任中医师岗位   一级主治中医师岗位    二级主治中医师岗位    三级主治中医师岗位    一级中医师岗位  二级中医师岗位   中医士岗位 
特级主任药师岗位    一级主任药师岗位    二级主任药师岗位    三级主任药师岗位    一级副主任药师岗位   二级副主任药师岗位   三级副主任药师岗位   一级主管药师岗位    二级主管药师岗位    三级主管药师岗位    一级药师岗位  二级药师岗位   药士岗位 
特级主任护师岗位    一级主任护师岗位    二级主任护师岗位    三级主任护师岗位    一级副主任护师岗位   二级副主任护师岗位   三级副主任护师岗位   一级主管护师岗位    二级主管护师岗位    三级主管护师岗位    一级护师岗位  二级护师岗位   护士岗位 
特级主任技师岗位    一级主任技师岗位    二级主任技师岗位    三级主任技师岗位    一级副主任技师岗位   二级副主任技师岗位   三级副主任技师岗位   一级主管技师岗位    二级主管技师岗位    三级主管技师岗位    一级技师岗位  二级技师岗位   技士岗位'''

rows=[]
for e in s.split('\n'):
    rows.append(e.split())

ret=[e for head in zip(*rows) for e in head]
for head in zip(*rows):
    print(head)
print(ret)

 
